---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairNotEnoughRiserCurvesError
source: html/3321a104-2169-3019-3dd5-6ccbaab40a75.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairNotEnoughRiserCurvesError Property

Boundaries (chains of one or more Boundary Lines) must be connected by at least two Riser Lines.

## Syntax (C#)
```csharp
public static FailureDefinitionId StairNotEnoughRiserCurvesError { get; }
```